from django.db import models

# каждая модель (каждый класс) наследуются от стандартного класс джанго(принимает его стандартные свойства). 
class Отзыв(models.Model):
    # каждая переменная класса - это название поля(колонки и таблицы)
    дата_поста = models.DateTimeField(
        # это поле автоматически считывает время компьютера и присваевает его тв качестве6 значения в момент создания записи в БД
        auto_now=True
    )
    картинка = models.ImageField(
        # в скобках указываем, в какую папку загружать новые картинки
        upload_to="медиа"
    )

    текст = models.TextField()
