from django.shortcuts import render, get_object_or_404, redirect

from .models import *
from .forms import *

def домашняя(реквест):
    # все функции в этом файле принимают обязательный аргумент, его принято называть реквест

    # Функция render отправляет страницу в процесс сборки, чтобы она отобразилась

    посты = Отзыв.objects.all()
    контекст = {
        "посты": посты,
        "надо_показывать_кнопку_читать_полностью": True,
    }
    return render(реквест,"главная.html", контекст)

def один_отзыв(реквест, айди_отзыва):
    отзыв = get_object_or_404(Отзыв, id=айди_отзыва)
    # функция get_object_or_404 либо возвращает одну запись из таблицы Отзыв, либо если отзыва с айди не существует, вызывает ошибку 404( страница не найдена )
    # т.к она должна вернуть ОДИН объект, вторым аргументом указываем название поля, по которому ищем запись, а после равно - значение, по которому фильтруемся. Наприме, если переменная айди_отзыва будет равна 1, то вернётся отзыв с id=1

    контекст = {"посты": [отзыв]}
    return render(реквест,"главная.html", контекст)

def фильтрация_по_тегу(реквест, имя_тега):
    искомый_тег = get_object_or_404(Тег, текст=имя_тега)
    # получиили запись из таблицы Тег, и дальше отфильтруем все отзывы, которые связаны с этим тегом

    # для этого получаем список всех отзывов и применяем к ним функцию filter
    посты = Отзыв.objects.all()
    отфильтрованные_посты = посты.filter(тег=искомый_тег)
    # в скобках filter указываем название локи, после равно запись тега, которую получили выше
    контекст = {
        "посты": отфильтрованные_посты,
        "надо_показывать_кнопку_читать_полностью": True,
    }
    return render(реквест,"главная.html", контекст)

def фильтрация_по_автору(реквест, айди_автора):
    искомый_автор = get_object_or_404(Юзер, id=айди_автора)
    # получиили запись из таблицы Тег, и дальше отфильтруем все отзывы, которые связаны с этим тегом

    # для этого получаем список всех отзывов и применяем к ним функцию filter
    посты = Отзыв.objects.all()
    отфильтрованные_посты = посты.filter(автор=искомый_автор)
    # в скобках filter указываем название локи, после равно запись тега, которую получили выше
    контекст = {
        "посты": отфильтрованные_посты,
        "надо_показывать_кнопку_читать_полностью": True,
    }
    return render(реквест,"главная.html", контекст)

def создать_отзыв(реквест):
    # для корректировки или создания объектов в БД (такие как отзыв) необходимо использовать ФОРМЫ. Они встроены в джанго, связываются с моделью, их поля отображаются в ХТМЛ. По заверешении написания отзыва форма автоматически проверяет корректность данных (она не позволит в int-поле ввести текст, или вместо картинки загрузить видео)

    # формы создаются в файле forms.py, импортируются во views.py

    # у каждой формы есть два действия:
    #1. показ формы юзеру, чтобы он её заполнил
    #2. проверка заполненной информации и сохранение и её в БД

    # за оба действия отвечает одна функция. Они разделяются по http-методу GET - получение или POST - отправка
    # GET - это значит пользователь открыл страницу
    # POST - когда он нажал кнопку "сохранить"

    # информация об http-методе находится в переменной "реквест"
    if реквест.method == "GET":
        форма = ФормаОтзыва()
        контекст = {"форма": форма}
        return render(реквест, "редактировать_отзыв.html", контекст)
    
    # сейчас был отправлен метод POST, в переменной "реквест" хранится вся информация от пользователя, в том числе файлы 
    # передаём эту информацию в форму, чтобы прошла проверка на корретных введённх данных
    заполненная_форма = ФормаОтзыва(реквест.POST, реквест.FILES)

    # корректность данных = "валидность" формы
    if заполненная_форма.is_valid():
        # если все данные валидны
        # надо превратить форму в объект БД. Но сели его сразу сохранить, БД ответит ошибкой - нет информации об авторе(в форме6 она не предполагалась).
        новый_отзыв = заполненная_форма.save(commit=False)
        # commit=False не позволяет создать запись в БД
        новый_отзыв.автор = реквест.user
        # автором будет тот юзер, который залогинен
        новый_отзыв.save()
        # и только теперь сохраням
        return redirect("один_отзыв", айди_отзыва=новый_отзыв.id)
        # каждая функция должна закончтся либо рендором страницы, либо перенаправлением на другую. redirect открывает страницу с тем name, который указан в urls
